<h1>операции</h1>
<h2>арифметические операции</h2>
<p>+ - * / ** %</p>
<p>Инкремент и декремент</p>
<?php
$i = 5;
$i++;
++$i;
echo $i++;
?>
<h2>операция со строками - конкатенация</h2>
<?php
$str1="Hello, ";
$str2='word';
echo $str1 . 55;
echo "  ", $str1 . $str2 . true;
?>
<h2>операция сравнения</h2>
<p> <> == != <= >= </p>
<?php
$a=(5==5);
echo $a;
?>
<h2>операция строгово сравнения</h2>
<p>=== !==</p>
<?php
$b = (5 == '5');
$c = (5 === '5');
echo "b = $b, c = $c";
?>
<h2>Логические операции</h2>
<p>И(&& или and) ИЛИ (|| или or) Не (!)</p>
<?php
$x = (true && false);
$y = (true || false);
?>
<h2>операция присваивания</h2>
<p> = </p>
<?php
$d = 'Hello';
$e = 5;
$f=3;
$e += 7;
$f *=$e;
?>
<P>= += -= /= **= .= </P>
<h2>приоритет операции</h2>
<p>** (++ --) ! (* / &) (+ - .) (< > <= >=) (== != == !==) && || (= += ...)</p>
