<h2>Задача 1</h2>
<form>
    <p>Введите число:</p>
    <input name="number">
    <input type="submit">
</form>
<?php
if(isset($_GET['number'])){
    $n = $_GET['number'];
    echo "выбранная цифра - " . $n . "<br>";
    echo match($n){
        "0" => "n - zero",
        "1" => "n - one",
        "2" => "n - two",
        "3" => "n - three",
        "4" => "n - four",
        "5" => "n - five",
        "6" => "n - six",
        "7" => "n - seven",
        "8" => "n - eight",
        "9" => "n - nine",
        default => "не подходит",
    };
}
?>
<h2>Задача 2</h2>
<form>
    <p>Введите число:</p>
    <input name="numbe">
    <input type="submit">
</form>
<?php
if(isset($_GET['numbe'])){
    $t = $_GET['numbe'];
    echo "номер месяца - " . $t . "<br>";
    echo match($t){
        "1"  => "праздники в этот месяц: 1 января - Новый Год, 7 января - Рождество",
        "2"  => "праздники в этот месяц: 14 февраля - День святого Валентина, 23 февраля - День защитника Отечества",
        "3"  => "праздники в этот месяц: 8 марта - Международный женский день, Масленнница",
        "4"  => "праздники в этот месяц: 1 апреля - День дураков, 12  апреля - День космонавтики, Пасха",
        "5"  => "праздники в этот месяц: 1  мая - Праздник Весны и Труда, 9 мая - День Победы",
        "6"  => "праздники в этот месяц: 1 июня - Международный день защиты детей, 12 июня - День России",
        "7"  => "праздники в этот месяц: 8 июля - День семьи, любви и верности",
        "8"  => "праздники в этот месяц: 22 августа - День государственного флага РФ",
        "9"  => "праздники в этот месяц: 1 сентября - День знаний",
        "10" => "праздники в этот месяц: 1 октября - Международный день пожилыхь людей, 31 октября - Хэллуин",
        "11" => "праздники в этот месяц: 4 ноября - День народного единства",
        "12" => "праздники в этот месяц: 31 декабря - Канун Нового года (Щедрый вечер)",
        default => "месяца с таким номером нет",
    };
}
?>
<h2>Задача 3</h2>
<form>
    <p>Введите число:</p>
    <input name="numbr">
    <input type="submit">
</form>
<?php
if(isset($_GET['numbr'])){
    $h = $_GET['numbr'];
    echo "Исходное число: $h<br>";
    $a = $h % 10;
    echo "последняя цифра: $a<br>";
    echo match($a){
        0,1,2,3,4,5,6,7,8,9 => "квадрат последней цифры: " . ($a*$a) . "<br>последняя цифра квадрата: " . ($a*$a)%10,
        default => "не подходит",
    };
}
?>
<h2>Задача 4</h2>
<form>
    <p>Введите число:</p>
    <input name="numbre">
    <input type="submit">
</form>
<?php
if(isset($_GET['numbre'])){
    $k = $_GET['numbre'];
    echo "Исходный введённый возраст: " . $k . "<br>";
    if($k == 11 || $k == 12 || $k == 13 || $k == 14){
        echo "Мне $k лет<br>";
    } elseif($k > 0 && $k < 100){
        $j = $k % 10;
        echo match($j){
            1 => "Мне $k год",
            2,3,4 => "Мне $k года",
            default => "Мне $k лет",
        };
    } else {
        echo "возраст не подходит";
    }
}
?>
